#include <omp.h>

#ifdef _MSC_VER
#define IPOPS_INLINE  __inline
#include <float.h>
#define IPOPS_ISINF(x) (!_finite(x))
#define IPOPS_ISNAN(x) (_isnan(x))

// MSVC STILL doesn't support C11
typedef uint32_t atomicpixel_t;
#else
//#include <pthread.h>
#include <fenv.h>
#include <stdatomic.h>
#define IPOPS_INLINE  inline
#define IPOPS_ISINF isinf
#define IPOPS_ISNAN isnan

typedef _Atomic uint32_t atomicpixel_t; /* underlying data is actually a float,
					   but we use this type because it permits
					   us to use atomic operations. YOU WILL
					   GET BAD DATA IF YOU ACCESS THIS DIRECTLY!!!
					*/

#endif


static IPOPS_INLINE float32_t *atomicbuf_sanitize(atomicpixel_t *buf,size_t n)
{
  /* sanitize atomic data in buf so it is OK to read it as floats */
  int64_t cnt;
  union cvt {
    float32_t *fptr;
    atomicpixel_t *iptr;
  } cvtptr;

  assert(sizeof(atomicpixel_t)==4);
  assert(sizeof(float32_t)==4);
  assert(sizeof(uint32_t)==4);

  cvtptr.iptr = buf;
  
#pragma omp parallel default(shared) private(cnt) //,n)
#pragma omp for
  for (cnt=0;cnt < n;cnt++) {
    union {
      char cbuf[4];
      float32_t fbuf;
      uint32_t ibuf;
    } cvtbuf;
    memcpy(&cvtbuf.ibuf,&cvtptr.iptr[cnt],4);
    memcpy(&cvtptr.fptr[cnt],&cvtbuf.fbuf,4);    
  }
  return cvtptr.fptr;
}


static IPOPS_INLINE atomicpixel_t *atomicbuf_prepare(float32_t *buf,size_t n)
{
  /* prepare float data in buf so it is OK to read it as atomics */
  int64_t cnt;
  assert(sizeof(atomicpixel_t)==4);
  assert(sizeof(float32_t)==4);
  assert(sizeof(uint32_t)==4);
  
  union cvt {
    float32_t *fptr;
    atomicpixel_t *iptr;
  } cvtptr;
  
  cvtptr.fptr = buf;

#pragma omp parallel default(shared) private(cnt)//,n)
#pragma omp for
  for (cnt=0;cnt < n;cnt++) {
    union {
      char cbuf[4];
      float32_t fbuf;
      atomicpixel_t ibuf;
    } cvtbuf;
    memcpy(&cvtbuf.fbuf,&cvtptr.fptr[cnt],4);
    memcpy(&cvtptr.iptr[cnt],&cvtbuf.ibuf,4);    
  }
  return cvtptr.iptr;
}


static IPOPS_INLINE float32_t atomicpixel_load(volatile atomicpixel_t *var)
{
  // Use of a union like this is legal in C11, even under the strictest
  // aliasing rules
  union {
    uint32_t intval;
    float32_t floatval;
  } pixval;
  pixval.intval=atomic_load_explicit(var,memory_order_acquire);//,memory_order_consume);

  return pixval.floatval;
}

static IPOPS_INLINE float32_t atomicpixel_nonatomicload(atomicpixel_t *var)
{
  // Use of a union like this is legal in C11, even under the strictest
  // aliasing rules
  union {
    uint32_t intval;
    float32_t floatval;
  } pixval;
  pixval.intval=*var;

  return pixval.floatval;
}

static IPOPS_INLINE void atomicpixel_store(volatile atomicpixel_t *var,float32_t val)
{
  // Use of a union like this is legal in C11, even under the strictest
  // aliasing rules
  union {
    uint32_t intval;
    float32_t floatval;
  } pixval;
  pixval.floatval=val;
  atomic_store_explicit(var,pixval.intval,memory_order_release);
  
}
static IPOPS_INLINE void atomicpixel_nonatomicstore(atomicpixel_t *var,float32_t val)
{
  // Use of a union like this is legal in C11, even under the strictest
  // aliasing rules
  union {
    uint32_t intval;
    float32_t floatval;
  } pixval;
  pixval.floatval=val;
  *var=pixval.intval;
  
}

//pthread_mutex_t accumulatemutex=PTHREAD_MUTEX_INITIALIZER;

static IPOPS_INLINE void atomicpixel_accumulate(volatile atomicpixel_t *var,float toadd)
{
  // Use of a union like this is legal in C11, even under the strictest
  // aliasing rules
  union {
    uint32_t intval;
    float32_t floatval;
    char workbuf[4];
  } oldvalue,newvalue; // ,workvalue;

  //  pthread_mutex_lock(&accumulatemutex);

  
  //oldvalue.floatval=atomicpixel_load(var);
  oldvalue.intval=atomic_load_explicit(var,memory_order_acquire);//,memory_order_consume);
  
  do {
    //memcpy(workvalue.workbuf,&oldvalue.intval,4);
    newvalue.floatval=oldvalue.floatval+toadd;
    //workvalue.floatval+=toadd;
    //memcpy(&newvalue.intval,&workvalue.workbuf,4);
  } while (!atomic_compare_exchange_strong_explicit(var,&oldvalue.intval,newvalue.intval,memory_order_seq_cst,memory_order_acquire)); //,memory_order_consume));


  //  pthread_mutex_unlock(&accumulatemutex);

}

static IPOPS_INLINE void atomicbuf_zero(atomicpixel_t *buf,size_t n)
{
  /* sanitize atomic data in buf so it is OK to read it as floats */
  int64_t cnt;
  assert(sizeof(atomicpixel_t)==4);
  assert(sizeof(float32_t)==4);
  
#pragma omp parallel default(shared) private(cnt) //,n)
#pragma omp for
  for (cnt=0;cnt < n;cnt++) {
    atomicpixel_nonatomicstore(&buf[cnt],0.0);
    
  }
}

static IPOPS_INLINE void normalize_atomic_buffer(atomicpixel_t *tonormalize,atomicpixel_t *normbuf,size_t n)
{
  /* Divide each element in tonormalize by the corresponding element in normbuf */
  int64_t cnt;
  assert(sizeof(atomicpixel_t)==4);
  assert(sizeof(float32_t)==4);
  
#pragma omp parallel default(shared) private(cnt)//,n)
#pragma omp for
  for (cnt=0;cnt < n;cnt++) {
    float32_t value,normalization;
    value=atomicpixel_nonatomicload(&tonormalize[cnt]);
    normalization=atomicpixel_nonatomicload(&normbuf[cnt]);

    value/=normalization;
    atomicpixel_nonatomicstore(&tonormalize[cnt],value);
    
  }
}


static IPOPS_INLINE void atomicbuffer_dropthreshold(atomicpixel_t *buf,atomicpixel_t *thresholdtestbuf,float32_t threshold,size_t n)
{
  /* Set each element in buf corresponding to an element of thresholdtestbuf that is less than threshold to 0 */
  int64_t cnt;
  assert(sizeof(atomicpixel_t)==4);
  assert(sizeof(float32_t)==4);
  
#pragma omp parallel default(shared) private(cnt)//,n)
#pragma omp for
  for (cnt=0;cnt < n;cnt++) {
    float32_t thresholdtest;
    thresholdtest=atomicpixel_nonatomicload(&thresholdtestbuf[cnt]);
    if (thresholdtest < threshold) {
      //bufval=atomicpixel_nonatomicload(&buf[cnt]);
      atomicpixel_nonatomicstore(&buf[cnt],0.0);
    }
    
  }
}



// C++: This should be implemented as an abstract interface
// that can either use a meshed representation (like this one)
// or a NURBS representation, depending on the surface object.
// ... Might also call OpenCL to do the heavy lifting

//#include <math.h>


///* Right now, OpenCV is used solely for matrix inversion... */
//#include <opencv2/core/version.hpp>
//#if (CV_MAJOR_VERSION >= 3)
//#include "opencv2/core/fast_math.hpp" // Temporary workaround for https://github.com/opencv/opencv/issues/6585
//#endif


//#include <opencv/cv.h>

/* splat characteristics for projecttoimgbuf */
